In [370]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [371]:
car_df = pd.read_csv('car_price.csv')

In [372]:
car_df

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats
...,...,...,...,...,...,...,...,...,...,...
5507,5507,BMW X1 sDrive 20d xLine,28.90 Lakh,"45,000 kms",Diesel,Automatic,1st Owner,2018,2995 cc,7 Seats
5508,5508,BMW M Series M4 Coupe,64.90 Lakh,"29,000 kms",Petrol,Automatic,2nd Owner,2015,1968 cc,5 Seats
5509,5509,Jaguar XF 2.2 Litre Luxury,13.75 Lakh,"90,000 kms",Diesel,Automatic,2nd Owner,2013,2755 cc,5 Seats
5510,5510,BMW 7 Series 730Ld,29.90 Lakh,"79,000 kms",Diesel,Automatic,3rd Owner,2015,2967 cc,6 Seats
5511,5511,BMW 5 Series 520d M Sport,31.90 Lakh,"42,000 kms",Diesel,Automatic,2nd Owner,2017,1991 cc,5 Seats

In [373]:
car_df.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats
2,2,Toyota Camry 2.5 G,16.40 Lakh,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats
3,3,Honda Jazz VX CVT,7.77 Lakh,"26,696 kms",Petrol,Automatic,1st Owner,2018,1199 cc,5 Seats
4,4,Volkswagen Polo 1.2 MPI Highline,5.15 Lakh,"69,414 kms",Petrol,Manual,1st Owner,2016,1199 cc,5 Seats

In [374]:
car_df.tail()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
5507,5507,BMW X1 sDrive 20d xLine,28.90 Lakh,"45,000 kms",Diesel,Automatic,1st Owner,2018,2995 cc,7 Seats
5508,5508,BMW M Series M4 Coupe,64.90 Lakh,"29,000 kms",Petrol,Automatic,2nd Owner,2015,1968 cc,5 Seats
5509,5509,Jaguar XF 2.2 Litre Luxury,13.75 Lakh,"90,000 kms",Diesel,Automatic,2nd Owner,2013,2755 cc,5 Seats
5510,5510,BMW 7 Series 730Ld,29.90 Lakh,"79,000 kms",Diesel,Automatic,3rd Owner,2015,2967 cc,6 Seats
5511,5511,BMW 5 Series 520d M Sport,31.90 Lakh,"42,000 kms",Diesel,Automatic,2nd Owner,2017,1991 cc,5 Seats

In [375]:
car_df.drop('Unnamed: 0', axis = 1 ,inplace=True)

In [376]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   car_name             5512 non-null   object
 1   car_prices_in_rupee  5512 non-null   object
 2   kms_driven           5512 non-null   object
 3   fuel_type            5512 non-null   object
 4   transmission         5512 non-null   object
 5   ownership            5512 non-null   object
 6   manufacture          5512 non-null   int64
 7   engine               5512 non-null   object
 8   Seats                5512 non-null   object
dtypes: int64(1), object(8)
memory usage: 387.7+ KB

In [377]:
car_df.describe()

       manufacture
count  5512.000000
mean   2015.455552
std       3.927974
min    1995.000000
25%    2013.000000
50%    2016.000000
75%    2018.000000
max    2022.000000

In [378]:
car_df.columns

Index(['car_name', 'car_prices_in_rupee', 'kms_driven', 'fuel_type',
       'transmission', 'ownership', 'manufacture', 'engine', 'Seats'],
      dtype='object')

In [379]:
car_df.shape

(5512, 9)

In [380]:
car_df.isnull().sum()

car_name               0
car_prices_in_rupee    0
kms_driven             0
fuel_type              0
transmission           0
ownership              0
manufacture            0
engine                 0
Seats                  0
dtype: int64

<h3> column 1 Car_Name </h3>

In [381]:
car_df.dropna(inplace=True) # use for remove duplicate value.

In [382]:
car_df['car_name']

0       Jeep Compass 2.0 Longitude Option BSIV
1                 Renault Duster RXZ Turbo CVT
2                           Toyota Camry 2.5 G
3                            Honda Jazz VX CVT
4             Volkswagen Polo 1.2 MPI Highline
                         ...
5507                   BMW X1 sDrive 20d xLine
5508                     BMW M Series M4 Coupe
5509                Jaguar XF 2.2 Litre Luxury
5510                        BMW 7 Series 730Ld
5511                 BMW 5 Series 520d M Sport
Name: car_name, Length: 5512, dtype: object

In [436]:
car_df['car_name'][0]

'Jeep'

In [384]:
x = car_df['car_name'][0]

In [385]:
x.index(" ")

4

In [386]:
x[:x.index(" ")]

'Jeep'

In [387]:
def car_name(x):
    return x[:x.index(" ")]

In [388]:
car_df["car_name"].apply(car_name)

0             Jeep
1          Renault
2           Toyota
3            Honda
4       Volkswagen
           ...
5507           BMW
5508           BMW
5509        Jaguar
5510           BMW
5511           BMW
Name: car_name, Length: 5512, dtype: object

In [431]:
car_df['car_name']  = car_df["car_name"].apply(car_name)

In [389]:
car_df["company_name"] = car_df["car_name"].apply(car_name)

<h3> Column 2 car_prices_in_rupee </h3>

In [390]:
car_df['car_prices_in_rupee']

0       10.03 Lakh
1       12.83 Lakh
2       16.40 Lakh
3        7.77 Lakh
4        5.15 Lakh
           ...
5507    28.90 Lakh
5508    64.90 Lakh
5509    13.75 Lakh
5510    29.90 Lakh
5511    31.90 Lakh
Name: car_prices_in_rupee, Length: 5512, dtype: object

In [392]:
#it is used when the number convertion requarement .
def rupee_change(x):
    p = x.split(" ")
    try:
        if p[1]=="lakh":
            return str (round(float(p[0])*100000,1))
        elif p[1]== "crore":
            return str(round(float(p[0])*100000,1))
    except:
             return x

In [393]:
car_df['car_prices_in_rupee'].apply(rupee_change)  # it returned none v because it it already store data in form of lakh if there is 
                                                    #-- in form of crore the then it would be changed

0       None
1       None
2       None
3       None
4       None
        ...
5507    None
5508    None
5509    None
5510    None
5511    None
Name: car_prices_in_rupee, Length: 5512, dtype: object

In [394]:
car_df['car_prices_in_rupee'] = car_df['car_prices_in_rupee'].str.replace(" ","")

In [395]:
car_df['car_prices_in_rupee'] = car_df['car_prices_in_rupee'].str.replace("Lakh","")

In [396]:
car_df['car_prices_in_rupee'] = car_df['car_prices_in_rupee'].str.replace("Crore","")

In [397]:
car_df['car_prices_in_rupee']

0       10.03
1       12.83
2       16.40
3        7.77
4        5.15
        ...
5507    28.90
5508    64.90
5509    13.75
5510    29.90
5511    31.90
Name: car_prices_in_rupee, Length: 5512, dtype: object

In [398]:
car_df['car_prices_in_rupee'].dtype

dtype('O')

In [399]:
car_df['car_prices_in_rupee'] = car_df['car_prices_in_rupee'].astype(float)

In [400]:
car_df['car_prices_in_rupee'].dtype

dtype('float64')

<h3> column 3  kms_Driven</h3>

In [401]:
car_df['kms_driven']

0       86,226 kms
1       13,248 kms
2       60,343 kms
3       26,696 kms
4       69,414 kms
           ...
5507    45,000 kms
5508    29,000 kms
5509    90,000 kms
5510    79,000 kms
5511    42,000 kms
Name: kms_driven, Length: 5512, dtype: object

In [402]:
car_df['kms_driven'] = car_df['kms_driven'].str.replace(",","") # remove coma (,)

In [403]:
car_df['kms_driven']

0       86226 kms
1       13248 kms
2       60343 kms
3       26696 kms
4       69414 kms
          ...
5507    45000 kms
5508    29000 kms
5509    90000 kms
5510    79000 kms
5511    42000 kms
Name: kms_driven, Length: 5512, dtype: object

In [404]:
car_df['kms_driven'] = car_df['kms_driven'].str.replace("kms","")

In [405]:
car_df['kms_driven']

0       86226
1       13248
2       60343
3       26696
4       69414
         ...
5507    45000
5508    29000
5509    90000
5510    79000
5511    42000
Name: kms_driven, Length: 5512, dtype: object

In [406]:
car_df['kms_driven'] = car_df['kms_driven'].astype('Int64')

In [407]:
car_df['kms_driven']

0       86226
1       13248
2       60343
3       26696
4       69414
        ...
5507    45000
5508    29000
5509    90000
5510    79000
5511    42000
Name: kms_driven, Length: 5512, dtype: Int64

In [408]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   car_name             5512 non-null   object
 1   car_prices_in_rupee  5512 non-null   float64
 2   kms_driven           5512 non-null   Int64
 3   fuel_type            5512 non-null   object
 4   transmission         5512 non-null   object
 5   ownership            5512 non-null   object
 6   manufacture          5512 non-null   int64
 7   engine               5512 non-null   object
 8   Seats                5512 non-null   object
 9   company_name         5512 non-null   object
dtypes: Int64(1), float64(1), int64(1), object(7)
memory usage: 436.1+ KB

<h2> column 7  Engine</h2>

In [409]:
car_df['engine']

0       1956 cc
1       1330 cc
2       2494 cc
3       1199 cc
4       1199 cc
         ...
5507    2995 cc
5508    1968 cc
5509    2755 cc
5510    2967 cc
5511    1991 cc
Name: engine, Length: 5512, dtype: object

In [410]:
car_df['engine'] = car_df['engine'].str.replace(" cc","")

In [411]:
car_df['engine']

0       1956
1       1330
2       2494
3       1199
4       1199
        ...
5507    2995
5508    1968
5509    2755
5510    2967
5511    1991
Name: engine, Length: 5512, dtype: object

In [412]:
car_df['engine'].astype("int64")

0       1956
1       1330
2       2494
3       1199
4       1199
        ...
5507    2995
5508    1968
5509    2755
5510    2967
5511    1991
Name: engine, Length: 5512, dtype: int64

<h3> column 8 Seats </h3>

In [413]:
car_df['Seats']

0       5 Seats
1       5 Seats
2       5 Seats
3       5 Seats
4       5 Seats
         ...
5507    7 Seats
5508    5 Seats
5509    5 Seats
5510    6 Seats
5511    5 Seats
Name: Seats, Length: 5512, dtype: object

In [414]:
car_df['Seats'].str.replace(" Seats","")

0       5
1       5
2       5
3       5
4       5
       ..
5507    7
5508    5
5509    5
5510    6
5511    5
Name: Seats, Length: 5512, dtype: object

In [415]:
car_df['Seats']

0       5 Seats
1       5 Seats
2       5 Seats
3       5 Seats
4       5 Seats
         ...
5507    7 Seats
5508    5 Seats
5509    5 Seats
5510    6 Seats
5511    5 Seats
Name: Seats, Length: 5512, dtype: object

In [425]:
 car_df['Seats'] = car_df['Seats'].str.replace(" Seats","")

In [426]:
car_df['Seats'].astype("int64")

0       5
1       5
2       5
3       5
4       5
       ..
5507    7
5508    5
5509    5
5510    6
5511    5
Name: Seats, Length: 5512, dtype: int64

<h2> column 6 Manufacture</h2>

In [427]:
car_df['manufacture']

0       2017
1       2021
2       2016
3       2018
4       2016
        ...
5507    2018
5508    2015
5509    2013
5510    2015
5511    2017
Name: manufacture, Length: 5512, dtype: int64

In [ ]:
#  it is used for date conversion
#pd.to_datetime(car_df)['manufature']    -->   there is required day month year but given only year thatswhy not apply

In [430]:
car_df.head()

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Jeep Compass 2.0 Longitude Option BSIV,10.03,86226,Diesel,Manual,1st Owner,2017,1956,5,Jeep
1,Renault Duster RXZ Turbo CVT,12.83,13248,Petrol,Automatic,1st Owner,2021,1330,5,Renault
2,Toyota Camry 2.5 G,16.40,60343,Petrol,Automatic,1st Owner,2016,2494,5,Toyota
3,Honda Jazz VX CVT,7.77,26696,Petrol,Automatic,1st Owner,2018,1199,5,Honda
4,Volkswagen Polo 1.2 MPI Highline,5.15,69414,Petrol,Manual,1st Owner,2016,1199,5,Volkswagen

In [ ]:
car_df.car_name.info()  # we can check single  column datatype and details

<class 'pandas.core.series.Series'>
RangeIndex: 5512 entries, 0 to 5511
Series name: car_name
Non-Null Count  Dtype
--------------  -----
5512 non-null   object
dtypes: object(1)
memory usage: 43.2+ KB

In [443]:
import sklearn

In [452]:
from sklearn.preprocessing import labelnEncoder,standardScaler

ImportError: cannot import name 'labelnEncoder' from 'sklearn.preprocessing' (c:\Users\HP\anaconda3\Lib\site-packages\sklearn\preprocessing\__init__.py)